<template lang="pug">
section.rule
  button.close(
    type="button"
    @click="$emit('close')"
  )
  figure.title
    img.pc(src="@/assets/img/rule/title.png", alt="alt")
    img.mb(src="@/assets/img/rule/title_M.png", alt="alt")
  .scrollBox(v-perfect-scroll)
    //- p
    //-   span 報名時間：
    //-   | 台灣時間xx月xx日中午12點至xx月xx日中午12點止
    //- p
    //-   span 報名資格：
    //-   | 對於成為一個偉大的歌手有興趣者
    //- p
    //-   span 報名方式：
    //-   | 於報名時間內，完成表單報名
    p 報名參賽選手須認真閱讀以下內容，並認可以下事項：
    ul
      li 《中國好聲音》全球海選組委會或其授權方有權通過www.singchinahx.com網站及採用其他方式調查、獲取和收集有關選手身份、參賽資格、報名資料等相關信息、材料、文檔。
      li 《中國好聲音》全球海選組委會或其授權方有權在2020《中國好聲音》全球海選經營範圍內，無限制、無償使用參賽選手提交的報名信息、材料，包括將該信息用於篩選賽事的選手入圍、晉級，賽事宣傳推廣，人才統計與推薦，及與大賽相關的其他事宜等。
      li 《中國好聲音》全球海選組委會或其授權方有權使用參賽選手參賽作品，包括用於篩選賽事的選手入圍、晉級，商業合作與開發，賽事宣傳推廣，人才統計與推薦，及與大賽相關的其他事宜等。
      li 《中國好聲音》全球海選組委會或其授權方在2020《中國好聲音》全球海選報名及比賽期間拍攝、錄製的選手相關音頻、視頻、圖片等資料，該等作品的版權歸屬《中國好聲音》全球海選組委會及其授權方所有，《中國好聲音》全球海選組委會及其授權方可根據其需要進行無償使用，報名參賽選手同意不對該等作品提出任何權利主張。
      li 報名選手確認已仔細、認真、審慎閱讀以上條款，並同意遵守由《中國好聲音》全球海選組委會或其授權方制定的各項規則和製度，尊重並接受組委會及賽事評委團做出的評判、決定等。
    p 該海選活動最終解釋權歸《中國好聲音》全球海選組委會所有，報名選手自願同意並接受以上條款，《中國好聲音》全球海選組委會或其授權方沒有必須選擇其參加比賽的義務，不存在強迫選手報名參賽行為。
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'ModalRule',
  setup() {
    return {
    }
  }
})
</script>
